voloviq/Bootloader_Pic18fxxkxx/main.c
/*
Function name   :   clear_buffer
Description     :   Function clear buffer
Input 1         :   u8 *: buffer to be clear
Input 2         :   u16 : number of elements to be clear
Output          :   None
Function return :   None
Testing result  :   Not tested yet
Test conditions :   AVT-5275v2 - MCU Clock 64MHz
Optymalization  :   For XC8 used - 'free'
Function valid  :   Function invalid - not tested yet
Function rev.   :   V1_0
Approved by     :   not approved yet
Issue date      :   20.VII.2015
Problem report  :   None
*/
static void clear_buffer(u8 *buf, u16 idx);




/*
Function name   :   jump_to_app
Description     :   Function only jump to user application
Input 1         :   None
Output          :   None
Function return :   None
Testing result  :   Not tested yet
Test conditions :   AVT-5275v2 - MCU Clock 64MHz
Optymalization  :   For XC8 used - 'free'
Function valid  :   Function invalid - not tested yet
Function rev.   :   V1_0
Approved by     :   not approved yet
Issue date      :   20.VII.2015
Problem report  :   None
*/
static void jump_to_app(void);




/*
Function name   :   erase_flash
Description     :   Function erase 64bit blocks
Input 1         :   u32: block address
Output          :   None
Function return :   None
Testing result  :   Not tested yet
Test conditions :   AVT-5275v2 - MCU Clock 64MHz
Optymalization  :   For XC8 used - 'free'
Function valid  :   Function invalid - not tested yet
Function rev.   :   V1_0
Approved by     :   not approved yet
Issue date      :   20.VII.2015
Problem report  :   None
*/
static void erase_flash(u32 address);




/*
Function name   :   write_flash
Description     :   Function write data to flash
Input 1         :   u32: block address
Input 2         :   u8*: buffer with data to be written
Input 3         :   u8: quantity of data to be written
Output          :   None
Function return :   None
Testing result  :   Not tested yet
Test conditions :   AVT-5275v2 - MCU Clock 64MHz
Optymalization  :   For XC8 used - 'free'
Function valid  :   Function invalid - not tested yet
Function rev.   :   V1_0
Approved by     :   not approved yet
Issue date      :   20.VII.2015
Problem report  :   None
*/
static void write_flash(u32 address, u8 *buffer, u8 length);




int main(int argc, char** argv)
{
    u32 hbeat = 0;


    /* Main Oscillator Configuration */

    /* Set Internal Oscillator Frequency to 16[MHz] */
    OSCCONbits.IRCF2 = 1;
    OSCCONbits.IRCF1 = 1;
    OSCCONbits.IRCF0 = 1;

    /* Set frequency stable bit */
    OSCCONbits.HFIOFS = 1;

    /* Enable Internal PLL x 4 - MCLK 64 [MHz] */
    OSCTUNEbits.PLLEN = 1;

    /* GPIO Ports Configuration */

    /* Heartbeat Led diode port configuration */
    TRISBbits.TRISB0 = 0;

    /* Initialize UART 1 - 9600, 8bits, 1stb, no parity */
    UART_init();
    
    /* Initialize receive buffer to 0xFF */
    for(hbeat=0; hbeat<PAGE_SIZE; hbeat++)
    {
        gbuffer[hbeat] = 0xFF;
    }

    while(1){
        if(hbeat == 0x03FF){
            LED = 1;
            hbeat++;
        }
        else if( hbeat == 0x2FFF ){
            LED = 0;
            hbeat++;
        }
        else if (hbeat == 0x1FFFF){
            hbeat = 0x00;
        }
        else{			
            hbeat++;
        }
        bootloader_state_machine(UART_getchar());
    }

  return (EXIT_SUCCESS);
}




/*static void delay_ms(u16 duration)
{
  u16 i;
  u16 j;
  for (i = duration; i != 0; i--){
    for (j = 0; j <= 1000; j++){
      asm("nop");
      asm("nop");
      asm("nop");
    }
    asm("nop");
    asm("nop");
  }
}*/




static void UART_init(void)
{
    TRISCbits.TRISC6 = 0; /* TX pin set as output */
    TRISCbits.TRISC7 = 1; /* RX pin set as input */

    /* Don't calculate Baudrate just take value from user manual
     page 339. */

    /* Sync = 0, BRGH = 0, BRG16 = 0 FOSC = 64MHz */
    TXSTAbits.SYNC = 0;
    TXSTAbits.BRGH = 0;
    BAUDCON1bits.BRG16 = 0;
    SPBRG = 103;

    /* Serial Port Enable Transmission - ON */
    TXSTAbits.TXEN = 1;

    /* Serial Port Enable bit - ON */
    RCSTAbits.SPEN = 1;

    /* Continous Receive Enable bit - ON */
    RCSTAbits.CREN = 1;
}




static void UART_putchar(u8 outchar)
{
    while(!TXSTA1bits.TRMT);

    TXREG1 = outchar;

    while(!TXSTA1bits.TRMT);
}




static u8 UART_getchar(void)
{   
    if(RCIF){
        while(!RCIF);
        if( (RCSTAbits.FERR == 1) || (RCSTAbits.OERR == 1) ){
            RCSTAbits.CREN = 0; /* Clear an error */
            RCSTAbits.CREN = 1; /* Start continous receiving again */
        }
        return((u8)RCREG1);
    }
    else{
        return(0);
    }
}




static u8 UART_wait_for_char(void)
{
    while(!RCIF);
    if( (RCSTAbits.FERR == 1) || (RCSTAbits.OERR == 1) ){
        RCSTAbits.CREN = 0; /* Clear an error */
        RCSTAbits.CREN = 1; /* Start continous receiving again */
    }
    return((u8)RCREG1);
}




static void send_boot_version(u8 *buf)
{
    u8 i = 0x00;

    do{
        if(buf[i] != '\0'){
            UART_putchar(buf[i]);
        }
    }while(buf[i++] != '\0');
}

    u8  byte_in_record = 0x00;
    u8  temp = 0x00;
    u8  crc = 0x00;
    u32 address = 0x00000000;
    u16 offset = 0x00;
    u8  record_type = 0x00;
    u8  end_of_record = 0x00;
    u16 byte_index = 0x00;
    u16 size = 0x00;
    u32 timeout = 0x00;
    u8  i = 0;
    u8 vl = 0;


static void bootloader_state_machine(u8 state)
{


    switch (state)
    {
        case 0xC1:{
            send_boot_version((u8 *)VERSION);	
            timeout = 0;
        break;
        }
        case 0xAA:{
            UART_putchar(0x55);
            state = 0x00;
        break;
        }
        case 0x31:{
            if(UART_wait_for_char() == 'Q'){
                if(UART_wait_for_char() == 'W'){
                    if(UART_wait_for_char() == 'E'){
                        if(UART_wait_for_char() == 'R'){
                            if(UART_wait_for_char() == 'T'){
                                for (u32 adr = APP_ENTRY; adr < FLASH_SIZE; adr += FLASH_ERASE_BLOCK){
                                    erase_flash(adr);
                                }
                                UART_putchar(0xEE);
                            }
                        }
                    }
                }
            }
            state = 0x00;
        break;
        }
        case 0x32:{	
            if(UART_wait_for_char() == 'Q'){
                if(UART_wait_for_char() == 'W'){
                    if(UART_wait_for_char() == 'E'){
                        if(UART_wait_for_char() == 'R'){
                            if(UART_wait_for_char() == 'T'){
                                /* Processing data which came from UART, byte after byte */
                                do{
                                    if(UART_wait_for_char() == RECORD_MARK){
                                        /* First byte is byte quantity in current record */
                                        byte_in_record = UART_wait_for_char();
                                        crc += byte_in_record; // Add to crc

                                        /* Get higher nibble of record address */
                                        temp = UART_wait_for_char();
                                        crc += temp; // Add to crc
                                        offset  = temp<<8;

                                        /* Get lower nibble of record address */
                                        temp = UART_wait_for_char();
                                        crc += temp; // Add to crc
                                        offset |= temp;

