voloviq/Bootloader_Pic18fxxkxx/main.c
                                        /* Get record type */
                                        temp = UART_wait_for_char();
                                        crc += temp; // Add to crc
                                        record_type = temp;
                                        
                                        /* Check what kind of record came */
                                        switch (record_type){
                                            case DATA_RECORD:
                                                if((u32)address == (u32)0x00){
                                                    /* Assign first address from offset */
                                                    address = (u32)offset;
    
                                                    vl = (u8)address;

                                                    vl = (vl % 0x3F)>>4;
                                                    
                                                    byte_index = (u16)(0x10*vl);

                                                    address = address - (u32)(vl<<4);
                                                    
                                                    size += byte_in_record;
                                                }
                                                else if((address+(u32)PAGE_SIZE) < (u32)(offset)){              
                                                    
                                                    /* Perform separate write */
                                                    erase_flash(address);
                                                    write_flash(address, gbuffer, PAGE_SIZE);
                                                    
                                                    /* Clear buffer after write to flash */
                                                    clear_buffer(gbuffer,PAGE_SIZE);
                                                    
                                                    /* Assign new address base on offset */
                                                    address = (u32)offset;
                                                    
                                                    vl = (u8)address;

                                                    vl = (vl % 0x3F)>>4;
                                                    
                                                    byte_index = (u16)(0x10*vl);

                                                    address = address - (u32)(vl<<4);
                                                    
                                                    // Assign clear new buffer size
                                                    size = (u16)byte_in_record;
                                                }
                                                else{                                            
                                                    size += (u16)byte_in_record;
                                                }
                                                /* One separate record analysis - data buffering */
                                                for(i=0; i<=byte_in_record; i++){
                                                    gbuffer[byte_index] = UART_wait_for_char();
                                                    crc += gbuffer[byte_index];
                                                    byte_index++;
                                                }
                                                byte_index--;
                                                if((crc&0xFF) == 0){
                                                    /* If collected page size byte, save page into flash */
                                                    if(byte_index >= PAGE_SIZE){
                                                        /* Perform separate write */
                                                        erase_flash(address);
                                                        write_flash(address, gbuffer, PAGE_SIZE);
                                                        
                                                        address = 0;
                                                    
                                                        /* Clear buffer after write to flash */
                                                        clear_buffer(gbuffer,PAGE_SIZE);
                                                    
                                                        byte_index = 0x00;
                                                        
                                                        size = (u16)0x00;
                                                    }
                                                    UART_putchar(0xCC);
                                                    crc = 0x00;
                                                    timeout = 0x00;
                                                }
                                                else{	
                                                    UART_putchar(0xCE);
                                                    crc = 0x00;
                                                }
                                                crc = 0;
                                                record_type = (u8)1;
                                                break;
                                            case END_OF_FILE_RECORD:
                                                /* If all page filled save into flash */
                                                if(byte_index != 0)
                                                {
                                                    erase_flash(address);
                                                    write_flash(address, gbuffer, PAGE_SIZE);
                                                }
                                                
                                                /* Perform separate write */
                                                clear_buffer(gbuffer,PAGE_SIZE);
                                                
