voloviq/Bootloader_Pic18fxxkxx/main.c
                                                end_of_record = 1; /* Last record detected */
                                                
                                                UART_putchar(0xF0);
                                                break;
                                            case EXTENDED_SEGMENT_ADDRESS_RECORD:
                                                /* According to specification the address should 
                                                be calculated as follow: */

                                                /* Get higher nibble of record address */
                                                temp = UART_wait_for_char();
                                                crc += temp; // Add to crc
                                                offset  = temp<<8;

                                                /* Get lower nibble of record address */
                                                temp = UART_wait_for_char();
                                                crc += temp; // Add to crc
                                                offset |= temp;

                                                if((crc&0xFF) == 0){
                                                    UART_putchar(0xCC);
                                                    timeout = 0x00;
                                                }
                                                else{
                                                    UART_putchar(0xCE);
                                                }
                                                crc = 0;
                                                break;
                                            case START_SEGMENT_ADDRESS_RECORD:
                                                break;
                                            case EXTENDED_LINEAR_ADDRESS_RECORD:
                                                /* If all page filled save into flash */
                                                if(byte_index != 0)
                                                {
                                                    erase_flash(address);
                                                    write_flash(address, gbuffer, PAGE_SIZE);
                                                
                                                    /* Perform separate write */
                                                    clear_buffer(gbuffer,PAGE_SIZE);
                                                }
                                                
                                                /* Get higher nibble of record address */
                                                temp = UART_wait_for_char();
                                                crc += temp; // Add to crc
                                                address  = (u32)temp<<24;

                                                /* Get lower nibble of record address */
                                                temp = UART_wait_for_char();
                                                crc += temp; // Add to crc
                                                address |= (u32)temp<<16;
                                                
                                                vl = (u8)address;

                                                vl = (vl % 0x3F)>>4;

                                                address = address - (u32)(vl<<4);
                                                
                                                if((crc&0xFF) == 0){
                                                    UART_putchar(0xCC);
                                                    timeout = 0x00;
                                                }
                                                else{
                                                    UART_putchar(0xCE);
                                                }
                                                crc = 0;
                                                break;
                                            case START_LINEAR_ADDRESS_RECORD:
                                                /* TBD */
                                                break;
                                            default: /* Unsupported record type */
                                                break;
                                        }
                                    }
                                    timeout++;
                                    /* Leave loop when processing finish or detected wrong crc */
                                }while((end_of_record != 1)||(timeout==100));
                            }
                            state = (u16)0;
                            byte_index = (u16)0;
                            offset = (u16)0;
                            byte_in_record = (u16)0;
                            record_type = (u8)0;
                            timeout = (u8)0;
                            end_of_record = (u8)0;
                            address = (u32)0;
                            size = (u16)0;
                            crc = (u8)0;
                        }
                    }
                }
            }
        break;
        }
        case 0x33:
        {
            UART_putchar(0x76);
            jump_to_app(); /* Jump to user application code */
        break;
        }
        default:
        {
            ;
        break;
        }
    }
}




static void clear_buffer(u8 *buf, u16 idx)
{
    u16 i = 0x00;
    for(i=0; i<idx; i++)
    {
        buf[i]=0xFF;
    }
}




static void jump_to_app(void)
{
    RCON |= 0x93; /* Set all flags as just after reset */
    asm("goto " ___mkstr(APP_ENTRY));
}




static void erase_flash(u32 address)
{
    PIR4bits.EEIF = 0;

    TBLPTRL = (address) & 0xC0;
    TBLPTRH = (address >> 8) & 0xFF;
    TBLPTRU = (address >> 16) & 0xFF;

    /*
     * bit 7, EEPGD = 1, memory is flash (unimplemented on J PIC)
     * bit 6, CFGS  = 0, enable acces to flash (unimplemented on J PIC)
     * bit 5, WPROG = 0, enable single word write (unimplemented on non-J PIC)
     * bit 4, FREE  = 1, enable write operation (1 if erase operation)
     * bit 3, WRERR = 0,
     * bit 2, WREN  = 1, enable write to memory
     * bit 1, WR    = 0,
     * bit 0, RD    = 0, (unimplemented on J PIC)
     */

