voloviq/Bootloader_Pic18fxxkxx/main.c
    EECON1 = 0x94; /* 0b10010100 */

    EECON2 = 0x55;          /* unlock sequence */
    EECON2 = 0xAA;          /* unlock sequence */
    EECON1bits.WR = 1;      /* start write or erase operation */

    INTCONbits.GIE = 1;

    while (!PIR4bits.EEIF);
    PIR4bits.EEIF = 0;
    EECON1bits.WREN = 0;
    EECON1bits.FREE = 0;    /* back to write operation */

    INTCONbits.GIE = 0;
}




static void write_flash(u32 address, u8 *buffer, u8 length)
{
    int counter;

    PIR4bits.EEIF = 0;

    TBLPTRL = (address) & 0xFF;
    TBLPTRH = (address >> 8) & 0xFF;
    TBLPTRU = (address >> 16) & 0xFF;

    /* The programming block is 32 bytes for all chips except x5k50 */
    /* The programming block is 64 bytes for x5k50 */

    /* Load max. 64 holding registers*/
    for (counter = 0; counter < length; counter++) {
      TABLAT = buffer[counter]; /* present data to table latch */
      /* write data in TBLWT holding register */
      /* TBLPTR is incremented after the read/write */
      #asm
          TBLWT*+
      #endasm;
    }

    /* One step back to be inside the 64 bytes range */
    #asm
        TBLRD*-
    #endasm;
    

    /* Start block write */
    /*
     * bit 7, EEPGD = 1, Flash Program or Data EEPROM Memory Select bit (1-Access Flash program memory)
     * bit 6, CFGS  = 0, Flash Program/Data EEPROM or Configure Select bit (0-Access Flash progrm or data EEPROM memory)
     * bit 5, -     = x, Bit unimplemented on PIC18Fxxkxx microcontrollers
     * bit 4, FREE  = 0, Flash Row Erase Enable bit (0-Performs write only)
     * bit 3, WRERR = 0, Flash Program/Data EEPROM Error flag bit (0-The write operation completed)
     * bit 2, WREN  = 1, Flash Program/Data EEPROM Write Enable bit (1-Allows write cycles to Flash program/data EEPROM) 
     * bit 1, WR    = 0, Write Control bit (0-Write cycle to the EEPROM is complete)
     * bit 0, RD    = 0, Read Control bit (0-Does not initiate an EEPROM read)
     */

    EECON1 = 0x84; /* 0b10000100 */

    INTCONbits.GIE = 0;

    EECON2 = 0x55;
    EECON2 = 0xAA;

    EECON1bits.WR = 1;  /* WR = 1; start write or erase operation */
                        /* WR cannot be cleared, only set, in software */
                        /* It is cleared in hardware at the completion */
                        /* of the write or erase operation */
                        /* CPU stall here for 2ms */

    INTCONbits.GIE = 1;

    while (!PIR4bits.EEIF);
    PIR4bits.EEIF = 0;
    EECON1bits.WREN = 0;
}